[
    {
        "title": "PERMANENT_ADAS I (COMPUTER OPERATOR...",
        "company": "Department of Social Welfare and Development Central Office - Government",
        "location": "Quezon City, Metro Manila",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/84535128?type=standard&ref=search-standalone&origin=cardTitle#sol=39f584bbfdc60dd3e10507072bf2bc7f2678bcb0",
        "description": "Place of Assignment:\nDSWD Central Office, IBP Road, Brgy. Batasan Hills, Quezon City\nPlace of Examination and Interview:\nDSWD Central Office, IBP Road, Brgy. Batasan Hills, Quezon City\nADMINISTRATIVE ASSISTANT I (COMPUTER OPERATOR I)\n(REPUBLICATION)\nItem Number\n:\nOSEC-DSWDB-ADAS1-119-2004\nCompensation\n:\nSG 7 (Php 20,110. 00)\nPlace of Assignment\n:\nLegal Service\nCSC-PRESCRIBED QUALIFICATION STANDARDS\nEducation\n:\nCompletion of two (2) year studies in college or High School Graduate with relevant vocational/trade course\nTraining\n:\nNone required\nExperience\n:\nNone required\nEligibility\n:\nCareer Service Sub-Professional/First (1st) level Eligibility/Relevant MC No. 11, s.1996 (Data Encoder Eligibility) (CSC MC No. 10, s. 2005) and (CSC MC No. 6, s. 2010/ CSC MC No. 6, s. 2020)\nPREFERRED QUALIFICATION STANDARDS\nEducation\n:\nGraduate of Bachelor’s Degree\nTraining\n:\nAt least four (4) hours of relevant training on records maintenance, computer literacy or other related training\nExperience\n:\nAt least six (6) months relevant experience involving records management and basic computer operations\nEligibility\n:\nCareer Service Sub-Professional/First (1st) level Eligibility\nPreferred Additional Qualifications\n:\n• Experience in government service a plus;\n• Good oral and written ability;\n• Remarkable attention to detail, results- oriented, can efficiently work under pressure;\n• Strong interpersonal skills, good moral character and work ethics;\n• Working knowledge of MS Office and other computer applications\nJOB DESCRIPTION\nUnder general supervision of LS Director, performs administrative support services functions related in the areas of financial management, property management and procurement management. Assist lawyers in case management especially but not limited to transcription of cases’ stenographic notes and other related activities, and does other related works. Designated as Records Management Officer.\nFunctions and Responsibilities:\n1. Draft basic memoranda and simple communications;\n2. Manage, indexing and docketing of case records (administrative, civil and criminal cases);\n3. Assist lawyers in case management especially but not limited to transcription of cases’ stenographic notes; monitoring of issuance of formal charge/notices/orders/decisions and other related activities;\n4. Inventory of Office Records Holdings and other related activities in records management;\n5. Attend to assigned administrative duties and responsibilities;\n6. From time to time, the Immediate Supervisor and Director may assign other related tasks and responsibilities.\nJob Outputs:\n1. Memoranda and basic legal documents within the prescribed deadline;\n2. Stenographic notes;\n3. Inventory of Office Records;\n4. Monitoring of cases;\n5. Organized Data Tracking System;\n6. Organized files/records; and\n7. Other reports as may be required.\nCRITERIA FOR EVALUATION\nEducation\n:\n25\\%\nTraining\n:\n10\\%\nExperience\n:\n25\\%\nWritten Examination\n:\n25\\%\nIQT\n:\n10\\%\nTechnical Exam\n:\n15\\%\nInterview\n:\n10\\%\nPerformance Review\n:\n5\\%\nTotal\n:\n100\\%\nInitial Shortlisting\n:\nObtain 75\\% of the maximum total score or 45 points in Education, Training, and Experience (ETE)\nFinal Shortlisting\n:\nTop five (5) highest rating but overall rating should not be less than 80\\%\nAPPLY NOW\nFill out the Job Application Form (JAF) and upload your complete requirements in a combined Portable Document Format (PDF) not exceeding 100 MB on or before June 7, 2025 by accessing this link:\nApplication Requirements:\n1. Application Letter stating the desired position, item number/code, and office/bureau/service/unit addressed to Director Jennifer M. Rizo, Director IV of Human Resource Management and Development Service;\n2. Duly accomplished, subscribed and sworn/notarized Personal Data Sheet (PDS) with a recent passport-size picture and thumb mark and Work Experience Sheet. You may download these forms through this link: .\n3. Authenticated or Photocopy of Transcript of Record or Diploma;\n4. Authenticated or photocopy of Transcript of Record or Certificate of Grades for Master’s Degree/Units earned, if applicable;\n5. Photocopy of relevant Training/Seminar Certificates;\n6. Certificate/s of Employment (COE) - required for work experiences acquired outside DSWD Central Office.\n7. Copy of Special Order or Certification indicating the supervisory/management experience/functions signed by the HRMO or any authorized representative (for Division Chief positions only or as may applicable);\n8. Copies of Appropriate Eligibility:\n  For RA 1080 Eligible (RSWs and/or other board passers only): \n- photocopy of RA1080 rating /Verified Eligibility:\n- photocopy of valid PRC ID \n    For BAR Passers only: \n- photocopy of BAR rating / Verified Eligibility -  \n- photocopy of valid IBP / BAR ID\n For CSC Passers only: \n- photocopy of CSC rating / Verified Eligibility -  \n9. Performance Rating in the last rating period or its equivalent, as may be applicable.\nNote: (i) For those applicants from the public sector vying for promotion, a performance rating is required. (ii) For internal (including COS workers) and external applicants from the public sector: Latest and duly approved Individual Performance Commitment and Review Form (IPCRF). (iii) External applicants from private sectors: In the absence of performance rating, you may use the Certificate of Performance Rating from your most recent employer. You may access the form through this link: .\nReminders:\n• In the event that you are able to proceed in the examination and panel interview, you will be required to submit the Valid NBI Clearance before the CO-HRMPSB deliberation for validation.\n• Files should be in a PDF and must not be compressed into archive file formats such as RAR or ZIP.\n• If applying for multiple positions, find the appropriate JAF for the position/s and submit separate applications/documents for each.\n• Requests for extension of submission and application with incomplete documents will not be entertained.\n• All communications pertaining to your application will be sent via email.\nStep-by-Step Guide in Applying for DSWD Job Vacancies:\nEQUAL EMPLOYMENT OPPORTUNITY PRINCIPLE\nAll vacant positions shall be open to all qualified applicants regardless of age, gender, civil status, disability, religion, ethnicity, social status, class, political affiliation, or other similar factors/personal circumstances which run counter to the principles of merit and fitness for the job and equal employment opportunity.\nDATA PRIVACY POLICY\nAll the personal information contained in documents submitted shall be used only for documentation and processing purposes within the DSWD and shall not be shared with any outside parties without your written consent. Personal information shall be retained and stored by the DSWD within the prescribed timeline in accordance with the National Archives of the Philippines’ General Disposition Schedule.\nJob Summary\nDate/Time Posted:\n2025-05-28 02:01:26\nPlace of Assignment:\nDepartment of Social Welfare and Development, Philippines, Southeast Asia\nEducation:\nCompletion of two years studies in College or High School Graduate with relevant vocational/trade course\nExperience:\nNone Required\nTraining:\nNone required\nEligibility:\nRelevant MC 11 s. 1996 (Data Encoder)/ Career Service (Sub-professional)/First Level Eligibility\nEmployment Status:\nRegular\nAvailable Positions:\n1\nSalary Grade:\n7"
    },
    {
        "title": "Cutting Operator",
        "company": "HANCOM SPI (formely SanCheong Philippines, Inc.)",
        "location": "Santo Tomas, Pasig City, Metro Manila",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/78615171?type=standard&ref=search-standalone&origin=cardTitle#sol=6fe6932e466e11e085936f79f4540f5932609852",
        "description": "At least with one year experience in Cutting operator .\nCan operate manual cutting machine.\nAt least high school graduate.\nCan work in minimum supervision.\nCan work under pressure.\nGood personality and team player            \n\nSummary of role requirements:\nLooking for candidates available to work:\nMonday: Morning, Afternoon\nTuesday: Morning, Afternoon\nWednesday: Morning, Afternoon\nThursday: Morning, Afternoon\nFriday: Morning, Afternoon\nSaturday: Morning, Afternoon\n1 year of relevant work experience required for this role\nWorking rights required for this role\nExpected start date for role: 01 October 2024"
    },
    {
        "title": "Store Head",
        "company": "Primer Group",
        "location": "Santa Ana, Manila City, Metro Manila",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/84128881?type=standard&ref=search-standalone&origin=cardTitle#sol=fb39967e29ace7d9b0d8d1ca32b270fc4b6c34ed",
        "description": "Job Summary\nA Store Head is primarily responsible for ensuring that store sales target is constantly achieved. Monitoring of the store’s inventory and submission of timely merchandise replenishment requests are to be ensured to ensure proper stock levels are healthy weekly. They are expected to train and engage direct reports to hit sales targets, comply with store standard operating procedures, and evaluate staff performance, including discipline for career growth. \nDuties and Responsibilities\nResponsible for ensuring that store sales target is consistently achieved;\nRegularly supervise control measures to minimize expenses such as utilities, supplies and the like;\nSupervises brand/marketing-initiated activities, store visual merchandising and local store marketing;\nSubmits daily store operations reports (sales, inventory and other qualitative reports) as needed;\nMonitors store inventory and submits timely merchandise replenishment requests to ensure that stock levels are healthy on a weekly basis;\nEnsures proper execution of periodic store inventory count, accurate and timely reporting of inventory variances and/losses including proper resolution of issues and concerns;\nObserve daily compliance to Nimbly checklist in the store;\nMonitors and quickly reports store equipment with needed fixtures (such as defective light, air conditioner, problems with store signage, internet and electric connectivity, CCTV and the like);\nDrives, train and engage direct reports to hit a sales target , comply with store standard operating procedures and evaluate staff performance, including discipline for career growth [store supervisors]\nJob Qualifications\nEducation Attainment\nCollege graduate (fresh graduates are welcome to apply)\nQualification\nRetail selling is a plus but not required\nDriven to sell and with great personality\nProficient computer skills - MS Applications\nGood oral and written communication\nHigh level of leadership and team dynamics\nStrong understanding of business goals and standards for customer service\nHighly analytical and innovative on problem solving."
    },
    {
        "title": "HR Assistant- Makati (Open for Fresh Graduates)",
        "company": "Demsey Resource Management Inc",
        "location": "Makati City, Metro Manila",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/83151150?type=standard&ref=search-standalone&origin=cardTitle#sol=615ec97737e648d6cea14a4c9fb517c0128fa664",
        "description": "• Assistance in assigned HR task\n• Documentation ana database Management\n• Other Ad hoc tasks as instructed\n\nQUALIFICATIONS:\n• Degree in Psychology, Human Resource Management or related field\n• Experience in handling different HR facets is an advantage\n• Organized and keen to details\n• Willing to be trained\n• Reliably commute or planning to relocate before starting work\n• FRESH GRADUATES are welcome to apply\n\nWORK LOCATION:\n• Bel-Air Village, Makati City (For reference relocation assistance is not provided)\n\nWORK SCHEDULE:\n• Mondays- Saturdays (On site)\n\nSALARY RANGE:\n• Open for discussion\n• Depends on experience\n\n*FOR DIRECT HIRING*"
    },
    {
        "title": "Marketing Support Associate- Bacolod",
        "company": "Filinvest Land Inc.",
        "location": "Bacolod City, Negros Occidental",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/83454852?type=standard&ref=search-standalone&origin=cardTitle#sol=fe49bf72b5949f2ca530574d83a6f15758a7de9d",
        "description": "The Marketing Support Assistant helps in implementing the sales and marketing strategies to help take the company to the next level. He or she is also involved in Marketing support and activities.\nMarketing Support\nHelps in creating and implementing effective marketing strategies to drive brand promotions across all marketing platforms\nCreates content for digital marketing channels and increase customer traffic and awareness through social media\nAssists in the ideation, production and execution of marketing communication efforts (e.e campaigns, launches etc)\nCoordinates interdepartmental for support\nProduce effective and cost-efficient marketing materials and collaterals on time and within budget\nIn-charge of the documentation and preparation of memos\nMarketing Activities\nAssist in management and seller-initiated activities to generate leads and sales for the cluster\nCoordinates, assists and negotiate to third-party agencies and/or suppliers to create an effective marketing activities and/or special events\nMakes sure that activities and events are well-organized and well-coordinated conducive for the clients and sales teams\nHelp in-charge of key organization tie-ups and sponsorships"
    }
]