[
    {
        "title": "EARN UP TO P19,000! | Foundever Baguio | Customer Service Representatives",
        "company": "Foundever®",
        "location": "Baguio City, Benguet",
        "salary": "₱14,000 – ₱19,000 per month",
        "link": "https://ph.jobstreet.com/job/79590396?type=standard&ref=search-standalone&origin=cardTitle#sol=a7ba8948d7ddd414d79297863ca988ca225edf40",
        "description": "Go further with Foundever™\nAre you ready to move your career forward? At Foundever™, you will find our call center jobs surprising. We believe in memorable associate experiences. Here, you can improve your quality of life and grow your career.\nWe believe that small moments can have a big impact on our work experiences, customers, teams, and friends. By creating positive moments for each other, we make a difference and improve our associate experience\nWhat are we looking for?\nNo work experience required (BPO experience is an advantage)\nCompleted at least Senior High School / High School Graduate or College Undergraduate / Graduate\nGood to excellent communication skills\nBasic computer navigation skills\nWilling to work on site in Baguio City, Benguet\nTIP: Have your government requirements (SSS, PAG-IBIG, etc.) numbers ready for faster application processing!\n What should you expect from us?\nFREE Call Center Training\nFREE shuttle services in selected locations (Pick-up points)\nFREE 28 days accommodation (Relocation assistance)\nPAID training from day one\nHMO Benefits for you and your family from day one\nTons of growth opportunities\nA leadership team that hears your voice; we know that when we work together we can accomplish so much more\nFun team environment where we work hard to build trust every single day\n*Terms & Conditions Apply.\n - Operations: Monday-Friday, 9:00 AM - 6:00 PM\n- Location: SM Cyber, Harrison Rd, Baguio City (Near Sunshine Park, beside Benguet Lab)"
    },
    {
        "title": "Certified Public Accountant | Las Piñas",
        "company": "Golden Haven Memorial Park, Inc.",
        "location": "Las Pinas City, Metro Manila",
        "salary": null,
        "link": "https://ph.jobstreet.com/job/85696157?type=standard&ref=search-standalone&origin=cardTitle#sol=8bc272070ea6fb061ad48ab58d2e4d71272b5e49",
        "description": "Responsibilities:\nRecords and analyzes business transactions.\nReviews and audits financial transactions and documents.\nAssists in monthly closing of accounting books and year-end audit financial reports.\nPrepares financial-related reports and analyses needed by the management for decision-making.\nPrepares regular bank reconciliations.\nEnsures implementation of policies, processes, and procedures and makes suggestions for improvement.\n Requirements:\nCandidate must have completed a Bachelor's degree in Accountancy and have passed the CPA licensure exam\nMust be detail-oriented and has strong analytical skill.\nMust be a team player and able to work in a multi-tasked environment with minimal supervision.\nAble to plan, prioritize and work to tight deadlines\nProficient in computer applications\nHas good oral and written communication skills\nPreferably with 1-year work experience. Fresh board passers may also apply."
    }
]