[
    {
        "title": "Team Lead - Client Facing (Dayshift - Onsite Cebu/Davao) w/ 10k SignOn Bonus",
        "company": null,
        "location": null,
        "salary": null,
        "link": "https://ph.jobstreet.com/job/85026210?type=standard&ref=search-standalone&origin=cardTitle#sol=b204774bc3062c3c08efcef8f359201ac81b4f30",
        "description": "Ready to switch to a fixed day shift schedule with weekends off?\nInterested in growing your leadership experience and directly engaging with clients in Australia?\nVA Platinum is hiring Team Leads!\nMULTIPLE ROLES OPEN!\nAbout the Role\nAs a Success Manager (Team Lead/Manager) at VA Platinum, you will play a pivotal role in client management and ensuring the seamless operation of our client-facing services. You will lead a team of Virtual Assistants (VAs), ensuring they meet client expectations and company standards.\nYour responsibilities will encompass direct client interaction, overseeing client projects, and aligning team efforts with client goals. Effective communication of company goals, safety practices, and deadlines is essential. You will motivate team members, assess performance, and provide crucial support to clients, including coaching and performance updates.\nIdeal Candidate (Must Have Experience)\nMinimum of 3 years of experience as a Team Lead/ Team Manager in the Virtual Assistant, BPO, KPO, or Shared Service industries.\nBachelor’s Degree holders are preferred.\nStrong Client Management or Account Management skills with experience in client dealings.\nHigh-level competence in Microsoft Office (skills in other software or CRMs will be an advantage).\nKey skills: Excellent written and verbal English, analytical thinking, strong organisational skills, and people management.\nKey attributes: Ability to work with a team, results-oriented, and client-focused.\nAmenable working onsite at either of our offices in Cebu and Davao (IT Park Cebu / Robinsons Cybergate Delta Davao)\nTasks and Responsibilities\nClient Interaction: Serve as the primary point of contact for clients, addressing their queries and concerns, and ensuring their needs are met promptly and effectively.\nOnboarding and Offboarding: Manage the onboarding and offboarding process of VAs, ensuring a smooth transition for clients.\nClient Support: Provide ongoing support to clients, including coaching, performance updates, and addressing any issues that arise.\nTeam Leadership: Communicate team goals, motivate team members, and assess their performance to ensure alignment with client objectives.\nQuality Assurance: Oversee the work of team members (VAs) to ensure quality and compliance with guidelines.\nStrategy Development: Develop and implement strategies to promote adherence to company regulations and performance goals.\nReporting: Generate and share comprehensive and detailed reports about performance, company-related objectives, and deadlines.\nTeam Meetings: Conduct team meetings to update on best practices and continuing expectations.\nWork Environment: Create a pleasant working environment that inspires the team.\nIndustry-leading benefits\nHMO w/ Dental Coverage + Dependents\n2-week paid Holiday Break. Enjoy the season without worrying about your work.\nFixed weekends off (Saturday and Sunday). Take control of your weekends, relax with loved ones, or indulge in your passions.\nTake advantage of working the day shift schedule! Wake up to the sunrise and wind down as the sun sets.\nWe have a virtual recruitment process. What you need\nStrong and Stable Internet Connection for uninterrupted video interviews\nLaptop or PC with Webcam for online assessments and interviews\n--\nAbout VA Platinum\nVA Platinum is a leading, fast-growing offshore staffing solution for Australian and New Zealand small and medium businesses. We recruit and manage virtual assistants (VAs) to empower business owners to achieve their goals. At the same time, we create meaningful opportunities for our staff in the Philippines to lead better lives.\nWe pride ourselves on having a supportive and collaborative team. We value energy, candid communication, and a high-performance work environment. We are looking for someone who fits well into this culture and can contribute positively to our team's dynamic.\nOther Career Opportunities\nGeneral Admin VAs\nDigital Marketing Specialists\nAU Accountants/Bookkeepers\nFinancial Planning VAs\nMortgage Broking VAs\nMortgage Parabrokers (anywhere in the PH)\nParaplanners\nExecutive Assistants\nTeam Manager - Client Facing"
    },
    {
        "title": "EARN UP TO P19,000! | Foundever Baguio | Customer Service Representatives",
        "company": null,
        "location": null,
        "salary": "₱14,000 – ₱19,000 per month",
        "link": "https://ph.jobstreet.com/job/79590396?type=standard&ref=search-standalone&origin=cardTitle#sol=bd97679fb88f88aafac1f81d5f6365ffbb3d72d4",
        "description": "Go further with Foundever™\nAre you ready to move your career forward? At Foundever™, you will find our call center jobs surprising. We believe in memorable associate experiences. Here, you can improve your quality of life and grow your career.\nWe believe that small moments can have a big impact on our work experiences, customers, teams, and friends. By creating positive moments for each other, we make a difference and improve our associate experience\nWhat are we looking for?\nNo work experience required (BPO experience is an advantage)\nCompleted at least Senior High School / High School Graduate or College Undergraduate / Graduate\nGood to excellent communication skills\nBasic computer navigation skills\nWilling to work on site in Baguio City, Benguet\nTIP: Have your government requirements (SSS, PAG-IBIG, etc.) numbers ready for faster application processing!\n What should you expect from us?\nFREE Call Center Training\nFREE shuttle services in selected locations (Pick-up points)\nFREE 28 days accommodation (Relocation assistance)\nPAID training from day one\nHMO Benefits for you and your family from day one\nTons of growth opportunities\nA leadership team that hears your voice; we know that when we work together we can accomplish so much more\nFun team environment where we work hard to build trust every single day\n*Terms & Conditions Apply.\n - Operations: Monday-Friday, 9:00 AM - 6:00 PM\n- Location: SM Cyber, Harrison Rd, Baguio City (Near Sunshine Park, beside Benguet Lab)"
    },
    {
        "title": "Archetype Marketing Manager",
        "company": null,
        "location": null,
        "salary": null,
        "link": "https://ph.jobstreet.com/job/86228666?type=standard&ref=search-standalone&origin=cardTitle#sol=c367a3ffa5cc9dacd4193c4488d1d15359751038",
        "description": "At Globe, our goal is to create a wonderful world for our people, business, and nation. By uniting people of passion who believe they can make a difference, we are confident that we can achieve this goal. Job Description\nThe Archetype Marketing Lead is responsible for driving hyper-localized marketing strategies based on geo-archetypes to deepen market penetration and foster customer loyalty within specific territories. This role involves comprehensive analysis of micro-market dynamics and distinct archetypes, followed by the design, execution, and performance monitoring of tailored offers and BTL on-ground marketing initiatives. The Archetype Marketing Lead plays a critical role in translating insights into actionable strategies that resonate with unique local consumer segments.\nMarket Analysis and Strategy Development Analyze consumer behavior, competitive intensity, distribution gaps, and adoption barriers within specific towns or archetypes. Interpret geo-archetype insights and translate them into localized micro-market offers and BTL marketing strategies. Monitor competitor activities, market trends, and regulatory changes within assigned territories to proactively identify opportunities and challenges.\nOffer and Campaign Design Develop, propose, and monitor micro-market offers aligned to the strategic posture of the town. Develop, propose, and refine BTL on-ground marketing strategies, activation plans, and community engagement initiatives tailored to the archetype Execution and Operations Management Work with the Marketing Activations team to execute BTL on-ground activations including events, roadshows, and community-based marketing programs tailored to the archetype.\nManage the allocated marketing budget for micro-market initiatives, ensuring efficient resource allocation and adherence to financial guidelines. Performance Monitoring & Optimization: Conduct post-mortem analyses on offer performance, campaign effectiveness, and activation ROI, then adjust strategies as needed. Prepare and present comprehensive performance reports, insights, and recommendations to the Territory\nGeneral Manager and other key stakeholders. Collaboration and Advocacy: Collaborate with Territory and National Segment Marketing Teams to align on archetype-specific value propositions and messaging. Act as the voice of the archetype, informing the broader marketing and strategy teams of local market needs and behavioral nuances.\nEqual Opportunity Employer Globe’s hiring process promotes equal opportunity to applicants, Any form of discrimination is not tolerated throughout the entire employee lifecycle, including the hiring process such as in posting vacancies, selecting, and interviewing applicants. Globe’s Diversity, Equity and Inclusion Policy Commitment can be accessed here Make\nYour Passion Part of Your Profession.\nAttracting the best and brightest Talents is pivotal to our success. If you are ready to share our purpose of Creating a Globe of Good, explore opportunities with us.\nGlobe Telecom, Inc. (Globe) is the leading Telecommunications company in the Philippines and the purveyor of the Filipino digital lifestyle. We provide cellular, broadband and mobile data services by focusing on enriching our content offerings amid customers' growing preference for multimedia platforms across multiple screens and devices. We want to enrich lives through communications by simplifying technology, so that we bring customers closer to what matters most.\nGlobe was also recognized as one of the Top companies to work for in Asia by Asia Corporate Excellence & Sustainability (ACES) Awards and Best Employer in the Telco category by Stevie’s New York.\nOur principal shareholders are Ayala Corp. and Singtel, both industry leaders in their respective countries and in the region. We are also a member of Bridge Alliance, Asia Pacific's leading mobile alliance of 36 mobile carriers. Purpose\nIn everything we do, we treat people right to create a Globe of Good. Vision\nWe see a Philippines where families' dreams come true, businesses flourish, and the nation is admired. Mission We create wonderful experiences for people to have choices, overcome challenges, and discover new ways to enjoy life."
    },
    {
        "title": "Certified Public Accountant | Las Piñas",
        "company": null,
        "location": null,
        "salary": null,
        "link": "https://ph.jobstreet.com/job/85696157?type=standard&ref=search-standalone&origin=cardTitle#sol=f1968102c0fd185b7fffcab85b0700291a7d59ab",
        "description": "Responsibilities:\nRecords and analyzes business transactions.\nReviews and audits financial transactions and documents.\nAssists in monthly closing of accounting books and year-end audit financial reports.\nPrepares financial-related reports and analyses needed by the management for decision-making.\nPrepares regular bank reconciliations.\nEnsures implementation of policies, processes, and procedures and makes suggestions for improvement.\n Requirements:\nCandidate must have completed a Bachelor's degree in Accountancy and have passed the CPA licensure exam\nMust be detail-oriented and has strong analytical skill.\nMust be a team player and able to work in a multi-tasked environment with minimal supervision.\nAble to plan, prioritize and work to tight deadlines\nProficient in computer applications\nHas good oral and written communication skills\nPreferably with 1-year work experience. Fresh board passers may also apply."
    },
    {
        "title": "Facilities Coordinator - Alabang",
        "company": null,
        "location": null,
        "salary": null,
        "link": "https://ph.jobstreet.com/job/80430091?type=standard&ref=search-standalone&origin=cardTitle#sol=d110bae56498872d14d9234d9499875647266cf1",
        "description": "About the Role:\nAs a CBRE Facilities Coordinator, you will work with clients, vendors, and contractors to ensure that facility tasks and work orders are complete.\nThis job is a part of the Facilities Management functional area which focuses on all aspects of the operations of a set of assets, providing support to the Property Managers regarding all repairs and investment plans.\nWhat You’ll Do:\nWork with landlords, tenants, and service providers to make sure they implement and recognize all procedures, policies, and reporting formats.\nAcknowledge all client inquiries and collect work orders.\nCollect information reports to find out performance and progress status.\nFile work orders, proposals, department files, and other paperwork submitted by vendors.\nMonitor activities that happen outside the building, such as proper waste disposal and recycling.\nFollow instructions, short correspondence, and memos and ask clarifying questions.\nRespond to common inquiries or complaints from clients, co-workers, and supervisors.\nUse existing procedures to solve straightforward problems while having a limited opportunity to exercise discretion.\nImpact through clearly defined duties, methods, and tasks are described in detail.\nDeliver own output by following defined procedures and processes under close supervision and guidance.\nWhat You’ll Need:\nHigh School Diploma or GED with up to 2 years of job-related experience.\nAbility to follow basic work routines and standards in the application of work.\nCommunication skills to exchange straightforward information.\nWorking knowledge of Microsoft Office products. Examples include Word, Excel, Outlook, etc.\nStrong organizational skills with an inquisitive mindset.\nBasic math skills. Ability to calculate simple figures such as percentages, discounts, and markups."
    }
]